Revit 2027 API
ParameterTypeId.SpaceAssocRoomNumber Property
 "Room Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpaceAssocRoomNumber { get; }
Public Shared ReadOnly Property SpaceAssocRoomNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpaceAssocRoomNumber {
	ForgeTypeId^ get ();
}
static member SpaceAssocRoomNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace